package com.rubel.rubelrana.bcs2;

/**
 * Created by RUBEL RANA on 2/9/2018.
 */

public class constritutionq {
    public String mQuestion[]={
            "PATC একটি ------ প্রতিষ্ঠান?",
            "আইনের দৃষ্টিতে সমতার বিধান- কত নং অনুচ্ছেদে উল্লেখ রয়েছে?",
            "ইসলামকে রাষ্ট্রধর্মের স্বীকৃতি দেয় কোন  সংশোধনীতে? ",
            "সংবিধানের শুরুতে 'বিসমিল্লাহীর রাহমানির রাহিম' সংযোজন করা হয় কবে?",
            "প্রথম শেণীর ম্যাজিস্ট্রেটগণ কত বছর পর্যন্ত কারাদন্ড দিতে পারেন?",
            "হাইকোর্ট বিভাগের স্থায়ী ব্রেঞ্চটি কোথায় ?",
            "বাংলাদেশের সংবিধান কি রকম?",
            "মুক্তিযুদ্ধকালীন ঢাকা কত নং সেক্টরে ছিল?",
            "মুক্তিযুদ্ধের সময় কোন সেক্টরে কোন নিয়মিত কমান্ডার ছিলনা?",
            "হস্তলিখিত সংবিধান প্রণয়ন কমিটির কোন ব্যক্তি স্বক্ষর করেনি?",
            "মুক্তিযুদ্ধে অবদানের জন্য কত জন নারী বীরশ্রেষ্ঠ খেতাব পান ?",
            "বাংলাদেশের সংবিধান কোন তারিখে গণপরিষদে গৃহীত হয়?",
            "বাংলাদেশের সংবিধান জাতীয় সংসদে উত্থাপন করেন কে?",
            "তত্ত্বাবধায়ক সরকারের অধীনে কোন সালে বাংলাদেশ প্রধম নির্বাচন অনুষ্ঠিত হয়?",
            "বাংলাদেশকে প্রথম স্বীকৃতিদানকারী প্রথম আরব রাষ্ট্র?",
            " চিন্তা ও বিবেকের স্বধীনতার বিষয়টি আমাদের সংবিধানের কোন অনুচ্ছেদে বর্ণিত?",
            "বাংলাদেশের সংবিধানে এ পর্যন্ত কতবার সংশোধনী আনা হয়?",
            "বাংলাদেশের নারীরা ইউনিয়ন পরিষদের সংরক্ষিত আসনে প্রথম সারাসরি ভোটে নির্বাচিত হন?",
    };
    private String mChoice[][] = {

            {"বেসরকারি","আধা সরকারি","সম্পূর্ণ সরকারি","স্বয়ত্বশাসিত"},
            {"৩৭ নং","২৭ নং","৩৭ নং","৩৮ নং"},
            {"৫ম","৭ম","৮ম","২য়"},
            {"১৯৭৭ সালে","১৯৮৪ সালে","১৯৭২ সালে","১৯৭৫ সালে"},
            {"সর্বোচ্চ ৩ বছর","সর্বোচ্চ ৪ বছর","সর্বোচ্চ ২ বছর","সর্বোচ্চ ১ বছর"},
            {"ঢাকায়","রাজশাহীতে","চট্রগ্রাম","খুলনা"},
            {"লিখিত","দুস্পরিবর্তনীয়","সুপরিবর্তনীয়","ক + খ"},
            {"১নং","২নং","৩নং","১০নং"},
            {"১নং","২নং","৩নং","১০নং"},
            {"সুরঞ্জিত সেনগুপ্ত","আবদুর রউফ","শিল্পাচার্য জয়নুল আবেদিন","বেগম রাজিয়া বানু"},
            {"২জন","৩জন","৪জন","একজনও না"},
            {"২ অক্টোবর ১৯৭২","৪ নভেম্বর ১৯৭২","২ ডিসেম্বর ১৯৭২","৪ জানুয়ারী ১৯৭৩"},
            {"বঙ্গবন্ধু শেখ মুজিবর রহমান","তাজউদ্দীন আহামদ","ডক্টর কামাল হোসেন","সৈয়দ নজরুল ইসলাম"},
            {"১৯৯১","১৯৯৬","১৯৭৬","১৯৮৬"},
            {"ইরাক","কুয়েত","মিশর","সিরিয়া"},
            {"৩৯","২৬","২৯","২৮"},
            {"১৪বার","১২বার","১৬বার","১৫বার"},
            {"১৯৯৫","১৯৯৬","১৯৯৭","১৯৯৮"},



    };
    private String  mCorrectAnswers [] = {"স্বয়ত্বশাসিত","২৭ নং","৮ম","১৯৭৭ সালে","সর্বোচ্চ ১ বছর",
            "ঢাকায়","ক + খ","২নং","১০নং","আবদুর রউফ","একজনও না","৪ নভেম্বর ১৯৭২","ডক্টর কামাল হোসেন",
            "১৯৭৬","ইরাক","৩৯","১৬বার","১৯৯৭"};
    public String getQuestion(int a){
        String qu = mQuestion[a];
        return qu;
    }
    public String getChoice1(int a){
        String choice = mChoice[a][0];
        return choice;
    }
    public String getChoice2(int a){
        String choice = mChoice[a][1];
        return choice;
    }
    public String getChoice3(int a){
        String choice = mChoice[a][2];
        return choice;
    }
    public String getChoice4(int a){
        String choice = mChoice[a][3];
        return choice;
    }
    public String getCorrectAnswer(int a){
        String answer = mCorrectAnswers[a];
        return answer;
    }

}
