package com.rubel.rubelrana.bcs2;

/**
 * Created by RUBEL RANA on 2/8/2018.
 */

public class knowledge {
    public String mQuestion[]={
            "সুইডেনের প্রধানমন্ত্রী আলা বেরসে কবে বাংলাদেশে এসেছেন?",
            "বাংলাদেশের জাতীয় বন?",
            "বাংলাদেশে মোট রেলওয়ে স্টেশনের সংখ্যা?",
            "বাংলাদেশের জাতীয় পতাকার ডিজাইনার?",
            "সিটি কর্পোরেশন কয়টি?",
            "সর্বশেষ ও ৪৯১ তম উপজেলা কোনটি?",
            "সর্বশেষ ও ৬৩৯ তম থানা কোনটি?",
            "সর্বশেষ ও ৩২৭ তম পৌরসভা কোনটি?",
            "ইউনিয়ন কয়টি?",
            "কাগুজে নোট",
            "ব্যাংক নোট",
            "পৃথিবীর বৃহত্তম দ্বীপ কোনটি?",
            "জাতিসংঘের সদর দপ্তর কোথায়?",
            "রোদে দাঁড়ানোর ফলে শরীর গরম হয় কেন?",
            "কোনটি বস্তু নয়?",
            "আমাদের দেশে মেট্রিক পদ্ধতি চালু হয়েছে ১৯৮২ সালের কোন মাসে?",
            "নেদারল্যান্ডের  মুদ্রার নাম কি?",
            "বাংলাদেশে মাথাপিছু কত কিলওয়াট বিদ্যুৎ খরচ হয়?",
            "বাংলাদেশে প্রচলিত কোন নোটটি ব্যাংক নোট নয়?",
            " কোনটি সার্কভুক্ত দেশের রাজধানী নয়?",
            "কোন ব্যাক্তিটি একই গোত্রভুক্ত নয়?",
            "একই মহাদেশ ভুক্ত নয়?",
            "বাংলাদেশে কয়টি বিমানবন্দর আছে?",
            "বাংলাদেশে কোন তারিখে প্রথম মুদ্রার প্রচলন হয়?",
            "পৃথিবীর সবচেয়ে বড় নদী কোনটি?",
            "কোনটিতে প্রোটিন নেই?",
            "সিপাহী বিপ্লব হয় কত সালে?",
            "পবিত্র বাইতুল  মোকাদ্দাস মসজিদ কোন শহরে অবস্থিত? ",
            "পৃথিবীর উচ্চতম অট্টালিকার নাম কি?",
            "আন্তর্জাতিক আদালতের সদর দপ্তর কোথায়?",
            "একটানা সর্বাধিক কতদিন নভোচারীরা মহাশূন্যে অবস্থান করেছেন? ",
            "বাংলাদেশের প্রধান বিচারপতি কে?",
            "বাংলাদেশের প্রধান বিচারপতি  কততম  বিচারপতি?",
            "পবিত্র কোরআন শরীফের প্রথম সূরার নাম কি?",
            "ইরান ইরাক যুদ্ধ শুরু হয়?",
            "অলিম্পিক ম্যারাথন দৌড়ে কত মাইল পথ অতিক্রম করতে হয়?",
            "পৃথিবীর সর্বাধিক লকের মাতৃভাষার নাম?",
            "বিশ্বের বৃহত্তম লাইব্রেরির নাম?",
            "চীনের প্রাচীরের দৈর্ঘ্য কত?",
            "বিশ্বের সর্ববৃহৎ মুসলমানদের দেশ কোনটি?",



    };
    private String mChoice[][] = {

            {"২ ফেব্রুয়ারী", "৫ ফেব্রুয়ারী", "৫ মার্চ", "৫ জানুয়ারী"},
            {"রমনা উদ্যান", "সোহরাওয়ার্দী উদ্যান", "বোটানিক্যাল উদ্যান", "বলদা গার্ডেন"},
            {"৪৮৯ টি", "৫০১ টি", "৫০৯ টি", "৫২০ টি"},
            {"রফিকুন্নবী", "কামরুল হাসান", "হাশেম খান", "জয়নাল আবেদীন"},
            {"১২ টি", "১০ টি", "১৪ টি", "৯ টি"},
            {"কুমিল্লার লালমাই", "হবিগঞ্জ", "মাধবদী পটুয়াখালী", "চট্রগ্রামের দোহাজাোনটি"},
            {"কুমিল্লার লালমাই", "মাধবদী পটুয়াখালী", "চট্রগ্রামের দোহাজাোনটি", "পিরুজপুর"},
            {"কুমিল্লার লালমাই", "চট্রগ্রামের দোহাজাোনটি", "মাধবদী পটুয়াখালটি", "হাজিপুর"},
            {"৪৫৪২ টি","৪৫৬৬ টি","৪৪৬২ টি","৪৫৬২ টি"},
            {"৭ টি", "৫ টি", "৬ টি", "৯ টি"},
            {"৯ টি", "৪ টি", "৭ টি", "৫ টি"},
            {"গ্রীনল্যান্ড","ফিলিফাইন","ইন্দোনেশিয়া","অস্ট্রেলিয়া"},
            {"আমস্টারডাম","অস্ট্রেলিয়া","নিউইয়র্ক","দি হেগ"},
            {"প্রতিফলন","পরিবহন","বিকিরন","পরিচলন"},
            {"মাটি","জল","লবন","বায়ু"},
            {"জানুয়ারারি","জুন","জুলাই","ডিসেম্বর"},
            {"ডলার","ক্রোন","ফ্রাঙ্ক","ইউরো"},
            {"১৫ ইউনিট","৩০ ইউনিট","৫০ ইউনিট","৭৫ ইউনিট"},
            {"৫০০ টাকা","১০০ টাকা","১ টাকা","১০ টাকা"},
            {"ঢাকা","কাঠমুন্ডু","ব্যাংকক","থিম্পু"},
            {"রুমেল","সিজার","ইউক্লিড","নেপোলিয়ান"},
            {"থাইলান্দ","বারমা","উগান্ডা","ভিয়েতনাম"},
            {"৩ টা","৪ টা","৬ টা","৯ টা"},
            {"১ জানুয়ারি ১৯৭২","১ মার্চ ১৯৭২","২৩ মার্চ ১৯৭২","১ জুলাই ১৯৭২"},
            {"গঙ্গা","মিসিসিপি","আমাজান","নীল নদ"},
            {"মাখন","ঘি","পানি","দুধ"},
            {"১৭৫৭","১৭৬৯","১৮১০","১৮৫৭"},
            {"জেরুজালেম","তেল আবির","বাগদাদ","রিয়াদ"},
            {"টুইন টাওয়ার","আইফেল তাওয়ার","বুর্জখলিফা","সিয়ারস টাওয়ার"},
            {"জেনেভা","নিউইয়র্ক","ব্রাসেলস","দি হগ"},
            {"২০০ দিন","১৫০ দিন","২৩৮ দিন","২৬০ দিন"},
            {"বিচারপতি সৈয়দ মাহমুদ হোসাইন","বিচারপতি সুরেন্দ্র কুমার সিনহা","বিচারপতি কে এম সোবহান","বিচারপতি মুস্তফা কামাল"},
            {"২০","২১","২২","২৩"},
            {"সূরা ফাতেহা","সূরা এখলাস","সূরা বাকারা","সূরা নাস"},
            {"১৯৭৯ সালে","১৯৮১ সালে","১৯৮২ সালে","১৯৮০ সালে"},
            {"৩০ মাইল ২০০ গজ","৪০ মাইল ১০০ গজ","২৫ মাইল ২৩০ গজ","২৬ মাইল ২৮৫ গজ"},
            {"ইংরেজি","চীনা","রাশিয়ান","ফরাসি"},
            {"ব্রিটিশ মিউজিয়াম","ইউনাইটেট স্টেটস লাইব্রেরি অব কংগ্রেস","নিউইয়র্ক পাবলিক লাইব্রেরি","একাডেম অব সায়েন্স"},
            {"২৪৮০","২২০০","৩৪২৪","৩২০০"},
            {"পাকিস্তান","ইরাক","সৌদি আরব","ইন্দোনেশিয়া"},
    };
    private String  mCorrectAnswers [] = {"৫ ফেব্রুয়ারী","সোহরাওয়ার্দী উদ্যান","৪৮৯ টি","কামরুল হাসান","১২টি","কুমিল্লার লালমাই",
            "মাধবদী পটুয়াখালী","চট্রগ্রামের দোহাজাোনটি","৪৫৬২ টি","৯ টি","৫ টি","গ্রীনল্যান্ড","নিউইয়র্ক","বিকিরন","বায়ু","জুন","ইউরো",
            "৭৫ ইউনিট","১ টাকা","ব্যাংকক","ইউক্লিড","উগান্ডা","৩ টা","১ মার্চ ১৯৭২","নীল নদ","পানি","১৮৫৭","জেরুজালেম","বুর্জখলিফা",
            "দি হগ","২০০ দিন","বিচারপতি সৈয়দ মাহমুদ হোসাইন","২২","সূরা ফাতেহা","১৯৮০ সালে","২৬ মাইল ২৮৫ গজ","চীনা",
            "ইউনাইটেট স্টেটস লাইব্রেরি অব কংগ্রেস","২২০০","ইন্দোনেশিয়া"};
    public String getQuestion(int a){
        String qu = mQuestion[a];
        return qu;
    }
    public String getChoice1(int a){
        String choice = mChoice[a][0];
        return choice;
    }
    public String getChoice2(int a){
        String choice = mChoice[a][1];
        return choice;
    }
    public String getChoice3(int a){
        String choice = mChoice[a][2];
        return choice;
    }
    public String getChoice4(int a){
        String choice = mChoice[a][3];
        return choice;
    }
    public String getCorrectAnswer(int a){
        String answer = mCorrectAnswers[a];
        return answer;
    }



}
