package com.rubel.rubelrana.bcs2;

/**
 * Created by RUBEL RANA on 2/9/2018.
 */

public class mathq {
    public String mQuestion[]= {

            "(a^2+1/a^2)=2 হলে (a+1/a)=? ",
            "দুটি সন্নিহিত কোণের সমষ্টি দুই সমকোণ হলে একটি আরেকটির ?",
            "কোন কিছু ধরা যাক(জনসংখ্যা)বৃদ্ধির ধারা যদি ২,৪,৮,১৬,৩২,৬৪ হারে বৃদ্ধি হতে তাকে তাহলে এই বৃদ্ধির হারকে?",
            "যদি দুটি কোনের একটি সাধারণ বাহু থাকে তবে একটি কোণকে অপর কোণের?",
            "দুটি সরল রেখা পরস্পর ছেদ করলে ছেদ বিন্দুতে যে চারটি কোণ উৎপন্ন হয় তাদের যে কোন একটি কোণকে তার বিপরীত কোণের?",
            "যে কোন দুটি বিন্দু দিয়ে কতটি সরল রেখা আঁকা যায়?",
            "সন্নিহিত সরল কোণের একটি ৯৫●হলে অপরটি ?",
            "১২০●কোণের সম্পূরক কোণ কত ?",
            "৬০● কোণের পূরক কোণ কত?",
            "দুটি সম্পূরক কোণের সমষ্টি?",
            "দুটি পূরক কোণের সমষ্টি?",
            "AB ওCD সরল রেখাদ্বয় o বিন্দুতে ছেদ করলে কোন গানিতিক যুক্তিটি সঠিক?",
            "ত্রিভুজ ABC এর AB=AC এবং <BAC=60● বহিঃস্থ <ACD=?",
            "ত্রিভুজ ABC তে AB=AC হলে নিচের কোনটি সত্য==<B=<Cহলে তৃতীয় কোণের মান কত?",
            "সমকোণী ত্রিভুজের অতিভুজ সংলগ্ন কোণ দুটির প্রত্যেকটি কি কোণ?",
            "ত্রিভুজের একটি কোণ অপর দুই কোণের সমান হলে ত্রিভুজটি?",
            "ত্রিভুজের দুইটি কোণের সমষ্টি এক সমকোণ হলে একটি আরেকটির?",
            "ত্রিভুজের দুইটি কোণের সমষ্টি দুই সমকোণের সমান হলে একটি আরেকটির?",
            "দুটি ত্রিভুজের মধ্যে কোন উপাদানগুলো সমান সত্ত্বেও ত্রিভুজ দুটি সর্বসম হবে না?",
            "ত্রিভুজের তিন কোণের সমদ্বিখন্ডকের ছেদ বিন্দুকে বলে ?",
            "ত্রিভুজের যে কোন বহিঃস্থ কোণের সমষ্টি ?",
            "ত্রিভুজের ভর কেন্দ্র প্রত্যেক মধ্যমাকে কোন অনুপাতে অন্তভিবক্ত করে?",
            "সমকোণী ত্রিভুজের সমকোণ সংলগ্ন বাহুদ্বয় যথাক্রমে ৩ ও ৪ সে.মি ঞলে এর অতিভুজের এর মান?",

            "যে সামন্তরিকের সকল বাহু সমান,কিন্তু কোণগুলো সমকোণ নয়?",
            "বৃত্তের কেন্দ্রস্থ কোণ পরিধিস্থ কোণের ?",
            "একটি সরল রেখার উপর অঙ্কিত বর্গ ঐসেরল রেখার এক চতুর্থাংশের উপর অঙ্কিত বর্গের ?",
            "ট্রাপিজিয়ামের অন্তঃস্থ কোণগুলো সমষ্টি?",
            "AC এবং BD একটি সামন্তরিকের দুটি কর্ণ o বিন্দুতে ছেদ করে ।অতএব?",
            "রম্বসের কর্ণদ্বয় o বিন্দুতে ছেদ করলে।কর্ণদ্বয়েরঅন্তর্ভূক্ত কোণ?",
            "দুটি বৃত্ত পরস্পর স্পর্শ করলে তাদের কেন্দ্রদ্বয় এবং স্পর্শবিন্দুর সংযোগ রেখা কেমন হবে?",
            "একটি সরল রেখার সাথে আরেকটি রেখাংশে মিলিত হয়ে যে সন্নিহিত কোণ উৎপন্ন করে ,তাদের সমষ্টি?",
            "একটি সরল রেখার উপর অঙ্কিত বর্গ ঐ সরল রেখার অর্ধেকের উপর অঙ্কিত বর্গের ?",
            "৯০ ডিগ্রি কোণের সম্পূরক কোন কত ডিগ্রি?",
            "রেখার প্রান্ত বিন্দুর সংখ্যা হল ?",
            "৭০ ডিগ্রি কোণের সম্পূরক কোন কত?",
            "২৫৩ ডিগ্রি কোণকে কি কোণ বলে?",
            "দু’টি সন্নিহিত কোণের সমষ্টি দুই সমকোণ হলে একটি অপরটির কি কোণ বলে?",
            "দুই সমকোন অপেক্ষা বড় ও চাঁর সমকোণ থেকে ছোট কোণকে কি বলে?",
            "সাধারণ ত্রিভুজের ক্ষেত্রফল?",
            "সমবাহু ত্রিভুজের ক্ষেত্রফল?",
            "সমবাহু ত্রিভুজের পরিসীমা?",
            "ABCত্রিবুজে AB বাহু =ACবাহু <C==55● হলে <A?",
            "সমকোণী ত্রিভুজাকৃতির একটির মাঠের অতিভুজ ও ভূমির দৈর্ঘ্য যথাক্রমে ১৩ মিটার ও ৫ মিটার ঞলে,ত্রিভুজের ক্ষেত্রফল কত?",
            "একটি সমবাহু ত্রিভুজের প্রত্যেকটির দৈর্ঘ্য ২ মিটার বাড়ালে এর ক্ষেত্রফল ৩∙৩ বেড়ে যায়। সমবাহু ত্রিভুজের বাহুর দৈর্ঘ্য কত?",
            "ত্রিভুজের তিন কোনের অনুপাত৩:৪:৫ হলে ছোট কোনের মান কত?",
            "একটি সমকোণী ত্রিভুজের সমকোণ সংলগ্ন বাহুদ্বয় ৪ সে.মিটার ও ৩ সে.মিটার।অতিভুজের উপর অঙ্কিত বর্গক্ষেত্রের ক্ষেত্রফল?",
            "কোন সমকোণী ত্রিভুজের সূক্ষ্মকোণদ্বয়ের পার্থক্য ১৬● হলে ক্ষুদ্রতম কোণের মান কত?",
            "একটি ত্রিভুজ একটি বৃত্তকে ন্যূনতম কতটি বিন্দুতে ছেদ?",
            "শতকরা ২০% দেবার পর এক ব্যক্তি একটি বই ৪.৮০ টাকায় বিক্রয় করলে আসল দাম কত?",
            "একটি  চতুর্ভুজের দৈর্ঘ্য পাচগুন ।   চতুর্ভুজটির চারবাহুর যোগফল ৭২ ফুট।  চতুর্ভুজের প্রস্থ কত?",
            "যদি ৭ মাইলে ১১.২৭ কি মি সমান হয় তবে ৯.৬ কিমি কত মাইল হবে? ",
            "পিতা-পুত্রের বয়সের অনুপাত ৭:৩। চার বছর পূর্বে এই অনুপাত ১৩ঃ৫ ছিল।পিতা ও পুত্রের বয়স কত?",
            "১ সের =?",
            "০.০৩ এর ০.০৫ গুন কত?",
            "০.০২৫ এর ১% কত?",
            "sin2θ cosecθ এর মান কত?",
            "কোনো বৃত্তের পরস্পর লম্ব দুইটি জ্যা এর সমান্তরাল কয়টি স্পর্শক আঁকা যায়?",
            "নিচের কোনটি সাহায্যে অনেক বড় বা অনেক ছোট সংখ্যাকে ছোট ও সহজ আকারে প্রকাশ করা যায়?",
            ".x3 y3=40 এবং xy=2 হলে, x y=কত?",
            "দুইটি সমবাহু ত্রিভুজের ক্ষেত্রফলের অনুপাত 9:16 হলে, পরিসীমার অনুপাত কত?",
            "একটি ঘনকের আয়তন 216 ঘন সে.মি. হলে প্রতিটি বাহুর দৈর্ঘ্য কত সে.মি.?",
            "ষড়ভুজের ছয় কোণের সমষ্টি কত ডিগ্রি?",
            "একই ভূমির উপর এবং একই সমান্তরাল রেখাযুগলের মধ্যে অবস্থিত সামান্তরিকক্ষেত্রসমূহের ক্ষেত্রফল কেমন?",
            "কোনো ধারার n তম পদ 2n হলে, ধারাটি নিচের কোনটি?",
            "ক্রমিক সংখ্যার প্রথম পদ n হলে ধারাটির প্রথম তিন পদের সমষ্টি কত?",
            "নিচের কোনটি ধনাত্মক সংখ্যা?",
            "একটি সমকোণী ত্রিভুজের  সমকোণসংলগ্ন বাহু দুইটি ডথাক্রমে 12 মিটার ও 5 মিটার হলে এর পরিসীমা কত হবে?",
            "একটি সংখ্যার অর্ধেক তার এক-ততীয়াংশের চেয়ে ১৭ বেশি,সংখ্যাটি কত?",
            "একটি সাভাবিক সংখ্যার বর্গের ৯ গুনের সাথে সংখ্যাটি যোগ করলে তা পরবর্তী স্বাভাবিক সংখ্যার সমান হয়",
            "কোন সংখ্যার ৪০% এর সাথে ৪২ যোগ করলে ফলাফল হবে সংখ্যাটির সমান।",
            "একটি শ্রেণীতে যত জন বালক ছিল প্রত্যেকে তত টাকা চাঁদা দিলে ১০০ টাকা হয়। বালকের সংখ্যা কত?",
            "মামুন ২৪০ টাকায় একই রকম কতগুলি কলম কিনে দেখল যে,যদি সে একটি কলম বেশি পেত তাহলে প্রতিটি কলমের মূল্য ১ টাকা কম পড়ত।সে কতগুলো কলম কিনেছিলো?",
            "দুই অংক বিশিস্ট একটি সংখ্যার এককের অংক দশকের অংক অপেক্ষা ৩ বেশি।সংখ্যাটি এর অংকদ্বয়ের সমস্টির ৩ গুন অপেক্ষা ৪ বেশি।সংখ্যাটি কত?",
            "এক ব্যক্তি তার স্ত্রীর চেয়ে ৫ বছরের বড়।তার স্ত্রীর বয়স ছেলের বয়সের ৪ গুন।৫ বছর পরে ছেলের বয়স ১২ হলে বর্তমান ঐ ব্যক্তির বয়স কত?",
            "দুটি সংখ্যার বিয়োগফল ৩৭ এবং যোগফল বিয়োগফলের ১১ গুণ। সংখ্যা দুটি কত?",
            "যদি দুটি সংখ্যার গুণফল৯৬এবং সংখ্যা দুটির যোগফল ২২ হয় তবে ছোট সংখ্যাটি কত?",
    };
    private String mChoice[][] = {
            {"1","2","3","4"},
            {"সম্পূরক কোণ","বিপ্রতীপ কোণ","অন্তঃস্থ কোণ","পূরককোণ"},
            {"জনসংখ্যা হার","জ্যামিতিক হার","গানিতিক গড়","জন্মহার"},
            {"সন্নিহিত কোণ","বিপ্রতীপ কোণ","সম্পূরক কোণ","একান্তর কোণ"},
            {"একান্তর কোণ","বিপ্রতীপ কোণ", "সন্নিহিত কোণ","সম্পূরক কোণ"},
            {"২ টি","১ টি","৩ টি","৪ টি"},
            {"৮৬● ","৬০●","৩০●","৯০●",},
            {"৯০● ","৬০●","৩০●","৪৫●"},
            {"৩০●","৪৫●","৬০●","৯০●"},
            {"৬০●","৩০●","১৮০●","৯০●"},
            {"৪৫●","৩০●","৯০●","৬০●"},
            {"<AOD><BOC","<AOD=<BOC","<AOD<<BOC","<AOD=১৮০●"},
            {"৬০●","৯০●","১২০●","১৮০●"},
            {"৬০●","৩০●","৮০●","৯০●"},
            {"সুক্ষ্ণকোণ","স্থুলকোণ","সমকোণ","পূরককোণ"},
            {"সুক্ষ্ণকোণী","সমকোণী","সমবাহু","স্থুলকোণী"},
            {"বিপ্রতীপ কোণ", "সন্নিহিত কোণ","অন্তঃস্থ কোণ","পূরককোণ"},
            {"সুক্ষ্ণকোণ","সমকোণী","পূরককোণ","সম্পূরককোণ"},
            {"১কোণ","২কোণ","৩কোণ"," কোনটাই না"},
            { "অন্তঃকেন্দ্র","ভরকেন্দ্র","পরিকেন্দ্র","কোনটাই না"},
            {"১ সমকোণ","২ সমকোণের চেয়ে বৃহত্তম","২ সমকোণের চেয়ে ছোট","২ সমকোণ"},
            {"২:১","১.৫","২.২","২.৫"},
            {"৩ সে.মি","৫ সে.মি","৮ সে.মি","২ সে.মি"},

            {"রম্বস", "বর্গ", "আয়ত","ট্রাপিজিয়াম"},
            {"৩ গুন", "৪ গুন", "২ গুন", "৫ গুন"},
            {"১২ গুন", "১৪ গুন", "১৬ গুন", "১৫ গুন"},
            {"৬০●","১৮০●","২৭০●","৩৬০●"},
            {"DO=BO","AD=AB","AC=BD","কোনটাই না"},
            {"সুক্ষ্ণকোণ","স্থুলকোণ","সমকোণ","পূরককোণ"},
            {"লম্ব","সরলরেখা","বক্ররেখা","কোনটাই না"},
            {"৬০●","১৮০●","৯০●","৩৬০●"},
            {"৩ গুন", "৪ গুন", "২ গুন", "৫ গুন"},
            {"৬০●","১০●","০●","৯০●"},
            {"তিনটি প্রান্ত বিন্দু","একটি প্রান্ত বিন্দু","দুটি প্রান্ত বিন্দু","কোন প্রান্ত বিন্দু নেই"},
            {"২০●","১১০●","৩০●","১০০●"},
            {"পূরককোণ","প্রবৃদ্ধি কোণ","স্থুলকোণ","সম্পূরক কোণ"},
            {"স্থুলকোণ","পূরককোণ","সম্পূরক কোণ","প্রবৃদ্ধি কোণ"},
            {"সম্পূরক কোণ","পূরককোণ","প্রবৃদ্ধি কোণ","স্থুলকোণ"},
            {"১/২ ×ভূমি×উচ্চতা","দৈর্ঘ্য + প্রস্থ","ভূমি×উচ্চতা","দৈর্ঘ্য + প্রস্থ"},
            {"(√৩)/৪(a^২)","৩/৪(a^২)","ভূমি×উচ্চতা","a/4 √(4b^2- a^2)" },
            {"২a","3a","4a","6a"},
            {"৭০●","১২০●","৬০●","৫৫●"},
            {"৩৬ বর্গমিটার","৬৫ বর্গমিটার","৩০ বর্গমিটার","৪৫ বর্গমিটার"},
            {"১ মিটার","২ মিটার","৩ মিটার","৪ মিটার"},
            {"৩০●","৪৫●","৬০●","১৩৫●"},
            {"৬ বর্গসে.মিটার","১২ বর্গসে.মিটার","২৫ বর্গসে.মিটার","৩০ বর্গসে.মিটার"},
            {"২৭●","৩৭●","৫৬●","১৭●"},
            {"১টি","২টি","৩টি","৪টি"},
            {"৫","৬","৮","১২"},
            {"৩০","৬","৮","৪০"},
            {"৫","৬","৮","১২"},
            {"৫০,৩০","৫৬,২৪","৫৮,২২","৬০,২০"},
            {"০.৯৩৩১ কেজি","১.২১ কেজি","০.৮৯১২ কেজি","০.৮০৮৯ কেজি"},
            {"০.০০১৫","০.০১৫","০.১৫","১.৫"},
            {"০.২৫","০.০২৫","০.০০২৫","০.০০০২৫"},
            {"ক)cosecθ","খ)cosθ","গ)sin2θ","ঘ)sinθ"},
            {"1","2","3","4"},
            {"সূচকের সাহায্যে","সমান (=) চিহ্নের সাহায্যে","ভগ্নাংশের সাহায্যে","গুণের সাহায্যে"},
            {"2","3","4","5"},
            {"3:4","4:3","9:13","13:9"},
            {"3","4","5","6"},
            {"5400","7200","8400","9600"},
            {"ভগ্নাংশ","বিপরীত","সমান","অসমান"},
            {"1 3 5 ...","3 4 5 ...","2 4 6...","1 2 3 ..."},
            {"3n 1","3n 3","3n 6","3n 7"},
            {"x>0","x<0","x=0","avobe all"},
            {"17 মিটার","18 মিটার","25 মিটার","30 মিটার"},
            {"৫২","৮৪","১০২","২০৮"},
            {"৭","৮","৯","১০"},
            {"৭০","৮০","৯০","৭৫"},
            {"১০","১০০","২৫","৩৫"},
            {"১৩টি ","১৪টি ","১৫টি ","১৬টি "},
            {"৪৭","৩৬","২৫","১৪"},
            {"৬৫ বছর","২৮ বছর","৩৩ বছর","৫৩ বছর",},
            {"২০,৫৭","১৯,৫৬","১৮৫,২২২","১৭০,২০৭"},
            {"৪","৬","৮","কোনটিই নয়"},




    };
    private String  mCorrectAnswers [] = {"2","সম্পূরক কোণ","জ্যামিতিক হার","সন্নিহিত কোণ",
            "বিপ্রতীপ কোণ","১ টি","৮৬● ","৬০●","৩০●","১৮০●","৯০●",
            "<AOD=<BOC","১২০●","৮০●","সুক্ষ্ণকোণ","সমকোণী","পূরককোণ","সম্পূরককোণ","৩কোণ",
            "অন্তঃকেন্দ্র","২ সমকোণের চেয়ে বৃহত্তম","২:১","৫ সে.মি","রম্বস","২ গুন","১৬ গুন","৩৬০●","DO=BO",
            "সমকোণ","সরলরেখা","১৮০●","৪ গুন","৯০●","কোন প্রান্ত বিন্দু নেই",
            "১১০●","প্রবৃদ্ধি কোণ","সম্পূরক কোণ","প্রবৃদ্ধি কোণ","১/২ ×ভূমি×উচ্চতা","(√৩)/৪(a^২)","3a","৭০●",
            "৩০ বর্গমিটার","২ মিটার","৪৫●","২৫ বর্গসে.মিটার","৩৭●","২টি","৬","৬","৬","৫৬,২৪",
            "০.৯৩৩১ কেজি","০.০০১৫","০.০০০২৫","ঘ)sinθ","4","সূচকের সাহায্যে","4","3:4","6","7200","সমান",
            "2 4 6...","3n 3","x>0","30 মিটার","১০২","৯","৭০","১০","১৫","২৫","৩৩","১৮৫,২২২","৮"};
    public String getQuestion(int a){
        String qu = mQuestion[a];
        return qu;
    }
    public String getChoice1(int a){
        String choice = mChoice[a][0];
        return choice;
    }
    public String getChoice2(int a){
        String choice = mChoice[a][1];
        return choice;
    }
    public String getChoice3(int a){
        String choice = mChoice[a][2];
        return choice;
    }
    public String getChoice4(int a){
        String choice = mChoice[a][3];
        return choice;
    }
    public String getCorrectAnswer(int a){
        String answer = mCorrectAnswers[a];
        return answer;
    }
}
