package com.rubel.rubelrana.bcs2;

/**
 * Created by RUBEL RANA on 2/8/2018.
 */

public class Questions {
    public String mQuestion[]={
            "কাজী নজরুল ইসলামের কয়টা গ্রন্থ নিষিদ্ধ হয়?",
            "কাজী নজরুল ইসলামের প্রথম গ্রন্থ কোনটি?",
            "কাজী নজরুল ইসলামের প্রথম উপন্যাস কোনটি?",
            "কাজী নজরুল ইসলামের প্রথম কাব্যগ্রন্থ কোনটি?",
            "কাজী নজরুল ইসলামের ছদ্মনাম কোনটি?",
            "উৎসব অনুষ্ঠানে বাজানো হয় রণসংগীতের প্রথম?",
            "উৎসব অনুষ্ঠানে বাজানো হয় জাতীয় সংগীতের প্রথম?",
            "বাংলাদেশের রণসঙ্গীত চল্ চল্ চল্ কোন কাব্যের অর্ন্তভুক্ত?",
            "বাংলাদেশের জাতীয় সংগীতের ইংরেজী অনুবাদক?",
            "বাংলাদেশের জাতীয় সংগীত বা আমার সোনার বাংলা রবীন্দ্রনাথ ঠাকুরের কোন্ কাব্যগ্রন্থের অন্তর্গত?",
            "সুশিক্ষিত লোক মাত্রই স্বশিক্ষিত-এই উক্তিটি কার?",
            " ‘সমকাল’ পত্রিকার সম্পাদক ছিলেন?",
            "বাংলা গদ্যের জনক বলা হয় কাকে?",
            " 'যে জন দিবসে মনের হরষে জালায় মোমের বাতি’কার লেখা?",
            " টিএস এলিয়েটের কবিতার বাংলা অনুবাদ করেন কে?",
            "‘সবিতা’ কাব্যগ্রন্থটি কার লেখা?",
            "'অগ্নিবীণা' কাব্যের কবিতা সংখ্যা কত?",
            "'গোঁফ খেজুরে’ বাগধারাটির অর্থ কী?",
            " হুমায়ূন আহমেদ বাংলা সাহিত্যে কি হিসেবে পরিচিত?",
            "নেতাজি সুভাষচন্দ্র বসুর অনুরোধে নজরুল কোন কবিতাটি লেখেন?",
            " বাংলা ভাষায় প্রথম কোরআন অনুবাদ কে করেন?",
            "রবীন্দ্রনাথের কোন উপন্যাসটি রাজনৈতিক?",
            "রবীন্দ্রনাথেরর শেষ কাব্যগ্রন্থ কোনটি?",
            "'সোনার তরী' কাব্যগ্রন্থটির রচিয়তা কে?",
            "গরুর শকট’ শব্দটি কী দোষে দুষ্ট?",
            "‘তার প্রেমি কি সুখ হতো সে যদি ভালোবাসিত’-এ গানের রচয়িতা কে?",
            "মাইকেল মধুসূদন দত্তের পত্রকাব্য কোনটি?",
            "“সকালে উঠিয়া আমি মনে মনে বলি,সারাদিন আমি যেন ভাল হয়ে চলি“-কার লেখা?",
            "'না, আমি যাব না’-এখানে ‘না’ কোন ধরনের অব্যয়?",
            "বাংলাদেশের জাতীয় সংগীত  কতসালে প্রথম পত্রিকায় প্রকাশিত হয়?",
            "বাংলাদেশের জাতীয় সংগীত প্রথম কোন পত্রিকায় প্রকাশিত হয়েছিলো?",
            "কায়কোবাদের 'মহাশ্মাশান' গ্রন্থটি কোন ধরনের রচনা?",
            "মাইকেল মধুসূদন দত্তের মহাকাব্যের নাম কি?",

    };
    private String mChoice[][] = {
            {"৩ টা","৪ টা","৫ টা","৬ টা"},
            {"ব্যাথারদান","অগ্নিবীণা","বাঁধনহারা","ধূপছায়া"},
            {"ব্যাথারদান","বাঁধনহারা","ধূপছায়া ","ছায়ানট"},
            {"অগ্নিবীণা","দোলনচাঁপা","বাঁধনহারা","প্রলয়"},
            {"বীরবল","ব্যাঙগাচি","বিদ্রোহী","ভানুসিংহ"},
            {"১০ চরণ","১৫ চরণ","১৮ চরণ","২১ চরণ"},
            {"৪ চরণ","৬ চরণ","৮ চরণ","৯ চরণ"},
            {"ব্যাথার দান","সন্ধ্যা","বিষের বাঁশি","মৃত্যু ক্ষুধা"},
            {"সৈয়দ আলী আহসান","কবীর চৌধুরী","সৈয়দ মান্নান","হাফিজুর রহমান"},
            {"বনফুল","সোনার তরী","সন্ধ্যা সঙ্গীত","গীতবিতান"},
            {"সৈয়দ আলী আহসান","প্রমথ চৌধুরী","সিকান্দার আবু জাফর","রবীন্দ্রনাথ ঠাকুর"},
            {"সৈয়দ আলী আহসান","সিকান্দার আবু জাফর","প্রমথ চৌধুরী","রবীন্দ্রনাথ ঠাকুর"},
            {"রাজা রামমোহন রায়কে","ঈশ্বরচন্দ্র বিদ্যাসাগরকে","প্রমথ চৌধুরীকে","বঙ্কিমচন্দ্র চট্টোপাধ্যায়কে"},
            {"ঈশ্বরচন্দ্র বিদ্যাসাগর","কৃষ্ণচন্দ্র মজুমদার","বঙ্কিমচন্দ্র চট্টোপাধ্যায়","বিষ্ণু দে"},
            {"বিষ্ণু দে","ঈশ্বরচন্দ্র বিদ্যাসাগর","কৃষ্ণচন্দ্র মজুমদার","বঙ্কিমচন্দ্র চট্টোপাধ্যায়"},
            {"সৈয়দ আলী আহসান","প্রমথ চৌধুরী","সত্যেন্দ্রনাথ দত্ত","কৃষ্ণচন্দ্র মজুমদার"},
            {"১৩ টা","১৪ টা","১২ টা","৮ টা"},
            {"গোঁফে ও খেজুরে","নিতান্ত অলস","উদাসীন","আরামপ্রিয়"},
            {"উপন্নাসিক হিসেবে","পরিচালক হিসেবে","কথাসাহিত্যিক হিসেবে","নাট্যকার হিসেবে"},
            {"বিদ্রোহী","কাণ্ডারী হুঁশিয়ারী","প্রলয়","মৃত্যু ক্ষুধা"},
            {" ঈশ্বর গুপ্ত","ভাই গিরীশ চন্দ্র সেন","রাজা রামমোহন রায়","ঈশ্বরচন্দ্র বিদ্যাসাগর"},
            {"চোখের বালি","গোরা","ঘরে বাইরে","চতুরঙ্গ"},
            {"চোখের বালি","শেষের কবিতা","ঘরে বাইরে","শেষ লেখা"},
            {"সামসুর রাহমান","সিকান্দার আবু জাফর","কাজী নজরুল ইসলাম","রবীন্দ্রনাথ ঠাকুর"},
            {"বাহুল্য দোষে","গুরুচণ্ডালী দোষে","আকাঙ্ক্ষার প্রয়োগ","বাগধারার শব্দ পরিবর্তন"},
            {"আলতাফ মাহমুদ","আবদুল গফ্ফার চৌধুরী","শ্রীধর কথক","আব্দুল লতিফ"},
            {"ব্রজাঙ্গনা কাব্য","বীরাঙ্গনা কাব্য","মেঘনাদবদ কাব্য","মহাশ্মাশান"},
            {"সামসুর রাহমান","মদনমোহন তর্কালঙ্কার","কাজী নজরুল ইসলাম","মদনমোহন বাগচী"},
            {"সমুচ্চায়ী অব্যয়","পদান্বয়ী অব্যয়","অনন্বয়ী অব্যয়","অনুকার অব্যয়"},
            {"১৯০৫ সালে","১৯১০ সালে","১৯১৮ সালে","১৯১৩ সালে"},
            {"সবুজপত্র","বাঙলার সংবাদ","বঙ্গদর্শন","কোনটি নয়"},
            {"ইতিহাস","গীতিকাব্য","মহাকাব্য","উপন্যাস"},
            {"ব্রজাঙ্গনা কাব্য","বীরাঙ্গনা কাব্য","মেঘনাদবদ কাব্য","মহাশ্মাশান"},

    };
    private String  mCorrectAnswers [] = {"৫ টা","ব্যাথারদান","বাঁধনহারা","অগ্নিবীণা","ব্যাঙগাচি","২১ চরণ","৪ চরণ",
            "সন্ধ্যা","সৈয়দ আলী আহসান","গীতবিতান","প্রমথ চৌধুরী","সিকান্দার আবু জাফর","ঈশ্বরচন্দ্র বিদ্যাসাগরকে","কৃষ্ণচন্দ্র মজুমদার",
            "বিষ্ণু দে","সত্যেন্দ্রনাথ দত্ত","১২ টা","নিতান্ত অলস","কথাসাহিত্যিক হিসেবে","কাণ্ডারী হুঁশিয়ারী","ভাই গিরীশ চন্দ্র সেন",
            "গোরা","শেষ লেখা","রবীন্দ্রনাথ ঠাকুর","গুরুচণ্ডালী দোষে","শ্রীধর কথক","বীরাঙ্গনা কাব্য","মদনমোহন তর্কালঙ্কার","অনন্বয়ী অব্যয়",
            "১৯০৫ সালে","বঙ্গদর্শন","মহাকাব্য","মেঘনাদবদ কাব্য"};
    public String getQuestion(int a){
        String qu = mQuestion[a];
        return qu;
    }
    public String getChoice1(int a){
        String choice = mChoice[a][0];
        return choice;
    }
    public String getChoice2(int a){
        String choice = mChoice[a][1];
        return choice;
    }
    public String getChoice3(int a){
        String choice = mChoice[a][2];
        return choice;
    }
    public String getChoice4(int a){
        String choice = mChoice[a][3];
        return choice;
    }
    public String getCorrectAnswer(int a){
        String answer = mCorrectAnswers[a];
        return answer;
    }


}
