package com.rubel.rubelrana.bcs2;

/**
 * Created by RUBEL RANA on 2/8/2018.
 */

public class scienceq {
    public String mQuestion[]={
            "Which is the first planet in the solar systm?",
            "Which is the second planet in the solar systm?",
            "Which is the third planet in the solar systm?",
            "Which is the fourth planet in the solar systm?",
            "Which is the fifth planet in the solar systm?",
            "Which is the sixth planet in the solar systm?",
            "Which is the seventh planet in the solar systm?",
            "Which is the eight planet in the solar systm?",
            "Which is the ninth planet in the solar systm?",
            "VIRUS এর পূর্ণরূপ কি?",
            "কোন মাধ্যমে শব্দের গতি সবচেয়ে কম?",
            "রঙিন টেলিভিশন হতে ক্ষতিকর কোন রশ্মি বের হয়?",
            "কোনটি বেশি স্থিতিস্থাপক?",
            "কোন নিষ্ক্রিয় গ্যাসে আটটি ইলেকট্রন নেই?",
            "শ্রেণিবিন্যাসের জনক কে?",
            "প্রাণী জগতকে কয়টি পর্বে ভাগ করা যায়?",
            "স্পঞ্জ নামে পরিচিত কোন পর্বের প্রাণীদের?",
            "সিলেনটারেটা কোন পর্বের প্রাণীদের বলা হয়?",
            "নিডুব্লাস্ট কোথায় থাকে?",
            "হাইড্রা কোন পর্বের প্রাণী?",
            "দেহ কিউটিকল দ্বারা আবৃত কোন পর্বের প্রাণীদের?",
            "শিখা অঙ্গ রেচন অঙ্গ হিসেবে কাজ করে কোন পর্বের প্রাণীদের?",
            "গোলকৃমি কোন পর্বের প্রাণী?",
            "কেঁচো কোন পর্বের প্রাণী?",
            "জোঁক কোন পর্বের প্রাণী?",
            "নেফ্রিডিয়া রেচন অঙ্গ কোন পর্বের প্রাণীদের?",
            "প্রাণিজগতের সবচেয়ে বৃহত্তম পর্ব কোনটি?",
            "সন্ধিযুক্ত উপাঙ্গ আচে কাদের?",
            "হিমোসিল কি?",
            "শামুক কোন পর্বের প্রাণী?",
            "নটোকর্ড কী?",
            "কর্ডাটা  পর্বকে কয় ভাগে ভাগ করা যায়?",
            "মেরুদন্ডী প্রাণীদের কয় শ্রেণিতে ভাগ করা যায়?",
            "হাঙ্গর কোন পর্বের প্রাণী?",
            "ফোলকার সাহায্যে শ্বাসকার্য চালায়?",
            "ইলিশ কোন পর্বের প্রাণী?",
            "ব্যাঙ কোন পর্বের প্রাণী?",
            "শিতল রক্তের প্রাণী কাদের বলে?",
            "বুকে ভর দিয়ে চলে?",
            "উষ্ণ রক্তের প্রাণী?",
            "মানুষের হৃদপিণ্ড কয় স্থর বিশিষ্ট?",
            "স্তন্যপায়ী প্রাণীদের মধ্যে কোন প্রাণী ডিম দেয়?",
            "শ্রেণিবিন্যাসের ধাপ কয়টি?",
            "কোনটি মলাস্কা পর্বের প্রাণী?",
            "অডিওমিটার যন্ত্র কি?",
            "একজন প্রাপ্ত বয়স্ক সুস্থ মানুষের হৃদস্পন্দন ঘটে মিনিটে?",


    };
    private String mChoice[][] = {
            {"Mercury","Venus","Mars","Saturn"},
            {"Jupiter","Venus","Earth","Neptune"},
            {"Earth","Jupiter","Pluto","Venus"},
            {"Jupiter","saturn","Mars","Earth"},
            {"Jupiter","Pluto","Mercury","Earth"},
            {"Uranus","Venus","Mars","Saturn"},
            {"Saturn","Pluto","Uranus","Earth"},
            {"Venus","Neptune","Pluto","Mars"},
            {"Mercury","Venus","Mars","Pluto"},
            {"INFORMATION RESOURCES UNDER SYNDROME","INFORMATION RESOURCES UNDER SEIZE","INFORMATION RESOURCES UNDER SYSTEM","INFORMATION RESOURCES UNDER SYMPTOM"},
            {"শূন্যতায়","কঠিন পদার্থে","তরল পদার্থে","বায়বীয় পদার্থে"},
            {"মৃদু রঞ্জন রশ্মি","বিটা রশ্মি","গামা রশ্মি","কসমিক রশ্মি"},
            {"ইস্পাত","রাবার","কাঁচ","পানি"},
            {"হিলিয়াম","নিয়ন","আর্গন","জেনন"},
            {"ক্যারোলাস লিনিয়াস","এরিস্ততল","জন রে","মেন্ডেলিফ"},
            {"৬","৭","৮","৯"},
            {"পরিফেরা","নিডারিয়া","প্লাটিহেলমিনথেস","অ্যানেলিডা"},
            {"পরিফেরা‌","প্লাটিহেলমিনথেস","নিডারিয়া","অ্যানেলিডা"},
            {"এক্টোডারম","এন্ডুডারম","রেচন তন্ত্রে","সিটা অঙ্গে"},
            {"পরিফেরা","প্লাটিহেলমিনথেস","নিডারিয়া","অ্যানেলিডা"},
            {"প্লাটিহেলমিনথেস","পরিফেরা‌","নিডারিয়া","অ্যানেলিডা"},
            {"নিডারিয়া","পরিফেরা‌","প্লাটিহেলমিনথেস","অ্যানেলিডা"},
            {"প্লাটিহেলমিনথেস","নেমাটোডা","অ্যানেলিডা","মলাস্কা"},
            {"অ্যানেলিডা","মলাস্কা","প্লাটিহেলমিনথেস","নেমাটোডা"},
            {"প্লাটিহেলমিনথেস","নেমাটোডা","অ্যানেলিডা","মলাস্কা"},
            {"মলাস্কা","প্লাটিহেলমিনথেস","নেমাটোডা","অ্যানেলিডা"},
            {"প্লাটিহেলমিনথেস","আরথ্রোপোডা","অ্যানেলিডা","মলাস্কা"},
            {"অ্যানেলিডা","মলাস্কা","প্লাটিহেলমিনথেস","আরথ্রোপোডা"},
            {"রক্তপূর্ণ গহব্বর","রক্তশুন্য গহব্বর","বড় গহব্বর","ছোট গহব্বর"},
            {"প্লাটিহেলমিনথেস","আরথ্রোপোডা","অ্যানেলিডা","মলাস্কা"},
            {"মেরুদন্ডের পর্বের অবস্থা","মেরুদন্ডের পরের অবস্থা","মেরুদন্ডের নাই তাদের অবস্থা","সবগুলো সত্য"},
            {"৯","৩","৫","৭"},
            {"৩","৯","৫","৭"},
            {"কনড্রিকথিস","অস্টিকথিস","উভচর","সরীসৃপ"},
            {"অস্টিকথিস","উভচর","কনড্রিকথিস","সরীসৃপ"},
            {"উভচর","সরীসৃপ","কনড্রিকথিস","অস্টিকথিস"},
            {"সরীসৃপ","উভচর","কনড্রিকথিস","অস্টিকথিস"},
            {"অস্টিকথিস","উভচর","সরীসৃপ","কনড্রিকথিস"},
            {"উভচর","কনড্রিকথিস","সরীসৃপ","অস্টিকথিস"},
            {"মাছ","দোয়েল","কাঁকড়া","জোঁক"},
            {"৪","৩","৫","৭"},
            {"গরিয়াল","দোয়েল","কুমীর","পেঙ্গুইন"},
            {"৪ টি","৩ টি","৫ টি","৭ টি"},
            {"কাঁকড়া","জোঁক","তারামাছ","ঝিনুক"},
            {"আলোর তীব্রতা পরিমাপ করে","শব্দের তীব্রতা পরিমাপ করে","গ্রহের দূরত্ব পরিমাপ করে","সমুদ্রের গভীরতা পরিমাপ করে"},
            {"৪০ বার","৫২ বার","৭২ বার","১০০ বার"},

    };
    private String  mCorrectAnswers [] = {"Mercury","Venus","Earth","Mars","Jupiter",
            "Saturn","Uranus","Neptune","Pluto","INFORMATION RESOURCES UNDER SEIZE","বায়বীয় পদার্থে",
            "মৃদু রঞ্জন রশ্মি","ইস্পাত","হিলিয়াম","ক্যারোলাস লিনিয়াস","৯","পরিফেরা‌","নিডারিয়া","এক্টোডারম",
            "নিডারিয়া","প্লাটিহেলমিনথেস","প্লাটিহেলমিনথেস","নেমাটোডা","অ্যানেলিডা","অ্যানেলিডা","অ্যানেলিডা",
            "আরথ্রোপোডা","আরথ্রোপোডা","রক্তপূর্ণ গহব্বর", "মলাস্কা","মেরুদন্ডের পর্বের অবস্থা","৩","৭",
            "কনড্রিকথিস","অস্টিকথিস","অস্টিকথিস","উভচর","উভচর","সরীসৃপ" ,"দোয়েল","৪","কুমীর","৭ টি","ঝিনুক","শব্দের তীব্রতা পরিমাপ করে","৭২ বার"};
    public String getQuestion(int a){
        String qu = mQuestion[a];
        return qu;
    }
    public String getChoice1(int a){
        String choice = mChoice[a][0];
        return choice;
    }
    public String getChoice2(int a){
        String choice = mChoice[a][1];
        return choice;
    }
    public String getChoice3(int a){
        String choice = mChoice[a][2];
        return choice;
    }
    public String getChoice4(int a){
        String choice = mChoice[a][3];
        return choice;
    }
    public String getCorrectAnswer(int a){
        String answer = mCorrectAnswers[a];
        return answer;
    }

}
